require 'csv'
require 'bigdecimal'

# https://www.jma.go.jp/jma/kishou/know/amedas/kaisetsu.html
data_csv = <<-TEXT
都府県振興局,観測所番号,種類,観測所名,ｶﾀｶﾅ名,所在地,緯度(度),緯度(分),経度(度),経度(分),海面上の高さ(ｍ),風速計の高さ(ｍ),温度計の高さ(ｍ),観測開始年月日,備考1,備考2
宗谷,11016,官,稚内,ﾜｯｶﾅｲ,稚内市開運　稚内地方気象台,45,24.9,141,40.7,3,23.5,−,#昭50.4.1,11903,−
上川,12442,官,旭川,ｱｻﾋｶﾜ,旭川市宮前1条　旭川地方気象台,43,45.4,142,22.3,120,46.4,−,平16.9.9,12927,−
石狩,14163,官,札幌,ｻｯﾎﾟﾛ,札幌市中央区北2条西　札幌管区気象台,43,3.6,141,19.7,17,−,−,平13.9.26,14913,気温、雨、日照
ｵﾎｰﾂｸ,17341,官,網走,ｱﾊﾞｼﾘ,網走市台町　網走地方気象台,44,1,144,16.7,38,15.6,−,#昭50.4.1,17917,−
十勝,20432,官,帯広,ｵﾋﾞﾋﾛ,帯広市東9条南,42,54.5,143,13.4,45,11.2,−,平10.1.28,−,風、日照
十勝,20751,官,広尾,ﾋﾛｵ,広尾郡広尾町並木通東　広尾特別地域気象観測所,42,17.6,143,19,32,20.1,−,#昭50.12.19,20965,−
胆振,21323,官,室蘭,ﾑﾛﾗﾝ,室蘭市山手町　室蘭地方気象台,42,18.7,140,58.5,40,18.2,−,#昭60.7.1,21930,−
渡島,23232,官,函館,ﾊｺﾀﾞﾃ,函館市美原　函館地方気象台,41,49,140,45.2,35,25.7,−,平4.7.23,23915,−
青森,31312,官,青森,ｱｵﾓﾘ,青森市花園　青森地方気象台,40,49.3,140,46.1,3,31.8,−,平元.12.1,31913,−
秋田,32402,官,秋田,ｱｷﾀ,秋田市山王　秋田地方気象台,39,43,140,5.9,6,40.8,−,平元.10.30,32927,−
岩手,33431,官,盛岡,ﾓﾘｵｶ,盛岡市山王町　盛岡地方気象台,39,41.9,141,9.9,155,15.5,−,#昭50.4.1,33927,−
宮城,34392,官,仙台,ｾﾝﾀﾞｲ,仙台市宮城野区五輪　仙台管区気象台,38,15.7,140,53.8,39,52.6,−,#昭57.3.1,34917,−
山形,35426,官,山形,ﾔﾏｶﾞﾀ,山形市緑町　山形地方気象台,38,15.3,140,20.7,153,14.9,−,#昭50.3.17,35927,−
福島,36126,官,福島,ﾌｸｼﾏ,福島市松木町　福島地方気象台,37,45.5,140,28.2,67,26.1,−,#昭50.3.13,36955,−
栃木,41277,官,宇都宮,ｳﾂﾉﾐﾔ,宇都宮市明保野町　宇都宮地方気象台,36,32.9,139,52.1,119,49.2,−,平元.12.20,41915,−
群馬,42251,官,前橋,ﾏｴﾊﾞｼ,前橋市元総社町,36,23.2,139,2.3,112,12.6,−,#昭50.2.27,−,風、日照
東京,44132,官,東京,ﾄｳｷｮｳ,千代田区北の丸公園,35,41.5,139,45.1,20,35.3,−,平19.11.1,−,風、日照
東京,44301,官,父島,ﾁﾁｼﾞﾏ,小笠原村父島字西町　父島気象観測所,27,5.5,142,11.4,3,15.8,−,昭61.3.18,−,−
東京,44356,官,南鳥島,ﾐﾅﾐﾄﾘｼﾏ,小笠原村南鳥島　南鳥島気象観測所,24,17.3,153,59,7,15.8,−,平22.6.1,−,−
静岡,50066,官,富士山,ﾌｼﾞｻﾝ,富士宮市富士山頂　富士山特別地域気象観測所,35,21.6,138,43.6,3775,−,−,平16.8.26,−,気温、日照
千葉,45147,官,銚子,ﾁｮｳｼ,銚子市川口町　銚子地方気象台,35,44.3,140,51.4,20,28.2,−,昭61.8.22,45900,−
長野,48156,官,長野,ﾅｶﾞﾉ,長野市箱清水　長野地方気象台,36,39.7,138,11.5,418,18.8,−,#昭50.3.24,48925,−
長野,48331,官,軽井沢,ｶﾙｲｻﾞﾜ,北佐久郡軽井沢町大字長倉,36,20.1,138,33.8,950,18.5,−,#昭50.12.2,−,風、日照
山梨,49142,官,甲府,ｺｳﾌ,甲府市飯田　甲府地方気象台,35,40,138,33.2,273,26.9,−,平5.3.18,49900,−
静岡,50331,官,静岡,ｼｽﾞｵｶ,静岡市駿河区曲金　静岡地方気象台,34,58.5,138,24.2,14,16,−,#昭50.3.23,−,−
愛知,51106,官,名古屋,ﾅｺﾞﾔ,名古屋市千種区日和町　名古屋地方気象台,35,10,136,57.9,51,17.8,−,#昭50.3.19,51900,−
新潟,54232,官,新潟,ﾆｲｶﾞﾀ,新潟市中央区女池南,37,53.3,139,2.9,0,15.1,−,平14.11.21,−,風、日照
富山,55102,官,富山,ﾄﾔﾏ,富山市石坂　富山地方気象台,36,42.5,137,12.1,9,20,−,昭61.1.30,55908,−
福井,57066,官,福井,ﾌｸｲ,福井市豊島　福井地方気象台,36,3.3,136,13.3,9,26.1,−,#昭50.3.15,57903,−
滋賀,60131,官,彦根,ﾋｺﾈ,彦根市城町　彦根地方気象台,35,16.5,136,14.6,87,19.7,−,#昭50.3.14,60915,−
大阪,62078,官,大阪,ｵｵｻｶ,大阪市中央区大手前　大阪管区気象台,34,40.9,135,31.1,23,−,−,平11.2.24,62900,気温、雨、日照
奈良,64036,官,奈良,ﾅﾗ,奈良市西紀寺町,34,40.4,135,49.9,90,19.9,−,#昭50.3.19,−,風、日照
広島,67437,官,広島,ﾋﾛｼﾏ,広島市中区上八丁堀,34,23.9,132,27.8,3,−,−,昭63.1.1,−,日照
島根,68132,官,松江,ﾏﾂｴ,松江市西津田　松江地方気象台,35,27.4,133,3.9,17,26.8,−,昭54.11.1,68960,−
香川,72086,官,高松,ﾀｶﾏﾂ,高松市伏石町　高松地方気象台,34,19.1,134,3.2,9,17.5,−,#昭50.4.1,72900,−
愛媛,73166,官,松山,ﾏﾂﾔﾏ,松山市桑原,33,50.1,132,47.6,41,17.8,−,#昭50.4.1,−,風、日照
高知,74181,官,高知,ｺｳﾁ,高知市比島町　高知地方気象台,33,34,133,32.9,1,15.5,−,#昭50.12.16,74900,−
山口,81428,官,下関,ｼﾓﾉｾｷ,下関市名池町,33,57.4,130,56.3,46,14.6,−,平8.6.27,−,風、日照
福岡,82182,官,福岡,ﾌｸｵｶ,福岡市中央区大濠　福岡管区気象台,33,34.9,130,22.5,3,−,−,平22.2.18,82900,気温、雨、日照
大分,83216,官,大分,ｵｵｲﾀ,大分市長浜町　大分地方気象台,33,14.1,131,37.1,5,19.8,−,#昭50.3.21,83900,−
長崎,84496,官,長崎,ﾅｶﾞｻｷ,長崎市南山手町　長崎地方気象台,32,44,129,52,27,18.6,−,#昭50.3.21,84900,−
佐賀,85142,官,佐賀,ｻｶﾞ,佐賀市駅前中央　佐賀地方気象台,33,15.9,130,18.3,6,56.1,−,平7.10.19,85900,−
熊本,86141,官,熊本,ｸﾏﾓﾄ,熊本市中央区京町　熊本地方気象台,32,48.8,130,42.4,38,−,−,#昭50.3.26,86905,気温、雨、日照
宮崎,87376,官,宮崎,ﾐﾔｻﾞｷ,宮崎市霧島　宮崎地方気象台,31,56.3,131,24.8,9,25.5,−,#昭50.3.31,−,−
鹿児島,88317,官,鹿児島,ｶｺﾞｼﾏ,鹿児島市東郡元町　鹿児島地方気象台,31,33.3,130,32.8,4,44.9,−,平6.2.25,88905,−
鹿児島,88836,官,名瀬,ﾅｾﾞ,奄美市名瀬港町　名瀬測候所,28,22.7,129,29.7,3,20.8,−,#昭50.3.17,−,−
沖縄,91197,官,那覇,ﾅﾊ,那覇市樋川　沖縄気象台,26,12.4,127,41.2,28,47.8,−,昭62.6.10,−,−
沖縄,92011,官,南大東,ﾐﾅﾐﾀﾞｲﾄｳ,島尻郡南大東村在所　南大東島地方気象台,25,49.7,131,13.7,15,22.5,−,昭54.3.14,−,−
沖縄,93041,官,宮古島,ﾐﾔｺｼﾞﾏ,宮古島市平良字下里　宮古島地方気象台,24,47.6,125,16.7,40,13.5,−,昭52.3.16,−,−
沖縄,94081,官,石垣島,ｲｼｶﾞｷｼﾞﾏ,石垣市登野城　石垣島地方気象台,24,20.2,124,9.8,6,28.9,−,昭52.3.8,−,−
TEXT

# 地点
# 'block_no' from https://www.data.jma.go.jp/gmd/risk/probability/info/number.html#info_station
name_to_block_no = {
'稚内' => 47401,
'北見枝幸' => 47402,
'羽幌' => 47404,
'雄武' => 47405,
'留萌' => 47406,
'旭川' => 47407,
'網走' => 47409,
'小樽' => 47411,
'札幌' => 47412,
'岩見沢' => 47413,
'帯広' => 47417,
'釧路' => 47418,
'根室' => 47420,
'寿都' => 47421,
'室蘭' => 47423,
'苫小牧' => 47424,
'浦河' => 47426,
'江差' => 47428,
'函館' => 47430,
'倶知安' => 47433,
'紋別' => 47435,
'広尾' => 47440,
'大船渡' => 47512,
'新庄' => 47520,
'若松' => 47570,
'深浦' => 47574,
'青森' => 47575,
'むつ' => 47576,
'八戸' => 47581,
'秋田' => 47582,
'盛岡' => 47584,
'宮古' => 47585,
'酒田' => 47587,
'山形' => 47588,
'仙台' => 47590,
'石巻' => 47592,
'福島' => 47595,
'白河' => 47597,
'小名浜' => 47598,
'輪島' => 47600,
'相川' => 47602,
'新潟' => 47604,
'金沢' => 47605,
'伏木' => 47606,
'富山' => 47607,
'長野' => 47610,
'高田' => 47612,
'宇都宮' => 47615,
'福井' => 47616,
'高山' => 47617,
'松本' => 47618,
'諏訪' => 47620,
'軽井沢' => 47622,
'前橋' => 47624,
'熊谷' => 47626,
'水戸' => 47629,
'敦賀' => 47631,
'岐阜' => 47632,
'名古屋' => 47636,
'飯田' => 47637,
'甲府' => 47638,
'河口湖' => 47640,
'秩父' => 47641,
'館野' => 47646,
'銚子' => 47648,
'上野' => 47649,
'津' => 47651,
'伊良湖' => 47653,
'浜松' => 47654,
'御前崎' => 47655,
'静岡' => 47656,
'三島' => 47657,
'東京' => 47662,
'尾鷲' => 47663,
'石廊崎' => 47666,
'網代' => 47668,
'横浜' => 47670,
'館山' => 47672,
'勝浦' => 47674,
'大島' => 47675,
'三宅島' => 47677,
'八丈島' => 47678,
'千葉' => 47682,
'四日市' => 47684,
'日光' => 47690,
'西郷' => 47740,
'松江' => 47741,
'境' => 47742,
'米子' => 47744,
'鳥取' => 47746,
'豊岡' => 47747,
'舞鶴' => 47750,
'萩' => 47754,
'浜田' => 47755,
'津山' => 47756,
'京都' => 47759,
'彦根' => 47761,
'下関' => 47762,
'広島' => 47765,
'呉' => 47766,
'福山' => 47767,
'岡山' => 47768,
'姫路' => 47769,
'神戸' => 47770,
'大阪' => 47772,
'洲本' => 47776,
'和歌山' => 47777,
'潮岬' => 47778,
'奈良' => 47780,
'山口' => 47784,
'厳原' => 47800,
'平戸' => 47805,
'福岡' => 47807,
'飯塚' => 47809,
'佐世保' => 47812,
'佐賀' => 47813,
'日田' => 47814,
'大分' => 47815,
'長崎' => 47817,
'熊本' => 47819,
'延岡' => 47822,
'阿久根' => 47823,
'人吉' => 47824,
'鹿児島' => 47827,
'都城' => 47829,
'宮崎' => 47830,
'枕崎' => 47831,
'油津' => 47835,
'屋久島' => 47836,
'種子島' => 47837,
'牛深' => 47838,
'福江' => 47843,
'松山' => 47887,
'多度津' => 47890,
'高松' => 47891,
'宇和島' => 47892,
'高知' => 47893,
'徳島' => 47895,
'宿毛' => 47897,
'清水' => 47898,
'室戸岬' => 47899,
'名瀬' => 47909,
'与那国島' => 47912,
'石垣島' => 47918,
'宮古島' => 47927,
'久米島' => 47929,
'那覇' => 47936,
'名護' => 47940,
'沖永良部' => 47942,
'南大東島' => 47945,
'父島' => 47971,
}

CSV.parse(data_csv, headers: :first_row) do |row|
  JmaPlace.seed(:name) do |p|
    p.number = row['観測所番号']
    p.name = row['観測所名']
    p.address = row['所在地']
    p.latitude = BigDecimal(row['緯度(度)']) + (BigDecimal(row['緯度(分)']) / BigDecimal('60'))
    p.longitude = BigDecimal(row['経度(度)']) + (BigDecimal(row['経度(分)']) / BigDecimal('60'))
    prec_no = row['観測所番号'][0..1]
    p.prec_no = (prec_no =~ /\a9[1-4]\Z/ ? '91' : prec_no)
    p.block_no = name_to_block_no[row['観測所名']]
  end
end

